tap "1password/tap"
tap "d12frosted/emacs-plus"
brew "ast-grep"
brew "automake"
brew "openssl@3"
brew "readline"
brew "awscli"
brew "bat"
brew "bat-extras"
brew "bison"
brew "chezmoi"
brew "duckdb"
brew "fd"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "go-jsonnet"
brew "jq"
brew "jsonnet-bundler"
brew "libffi"
brew "libyaml"
brew "lsd"
brew "mcfly"
brew "mise"
brew "postgresql@15", restart_service: :changed
brew "ripgrep"
brew "sleek"
brew "starship"
brew "tmux"
brew "watchman"
brew "yq"
brew "zile"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@31", args: ["with-dragon-icon", "with-imagemagick"]
cask "1password-cli"
cask "alfred"
cask "dash"
cask "docker-desktop"
cask "fantastical"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-maple-mono"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "session-manager-plugin"
cask "spotify"
cask "zen"
